[   
    {"number":"1","name":"MyShop", "type":"iOS Mobile Application", "languages":["Swift", "UiKit", "Express", "Ruby"], "Description": "Developed using Swift with a primary focus on UIKit. Features include User authentication and user-related data storage using Firestore. Product exploration interface using Collection View.Cart functionality allowing users to add desired products.Payment simulation using Stripe with test card support.Utilised UIKit elements including Table View and Navigation Controllers.","testflight":"https://testflight.apple.com/join/tJebjWy0", "github":"https://github.com/Anup-SoftwareDev/MyShop", "image":"0"},    

{"number":"2","name":"SearchAPlace", "type":"iOS Mobile Application", "languages":["Swift", "UIKit"], "Description":"Developed using Swift with an emphasis on UIKit. Features: Enables users to search for nearby places based on their current location.Lists relevant places closest to the user with details like address,distance, route, and photos. Leverages the Foursquare API to fetch extensive placerelatedinformation. Integrates MapKit and Apple’s CoreLocation for map visualization androuting functionalities. Utilised UIKit elements including Table View, Navigation Controllers,and Collection Views.","appstore":"https://apps.apple.com/au/app/searchaplace/id6452240296", "github":"https://github.com/Anup-SoftwareDev/SearchPlaces", "image":"1"},
    
{"number":"3","name":"SolarSystemPlanets", "type":"iOS Mobile Application", "languages":["Swift", "UIKit"],  "Description":"An informative app that combines TableView and Navigation Controller to offer detailed insights on various solar system planets.","appstore":"https://apps.apple.com/au/app/solarsystemplanets/id6451026524", "github":"https://github.com/Anup-SoftwareDev/SolarSystem", "image":"2"},

{"number":"4","name":"Northern Detailing", "type":"Web Application", "languages":["React", "JavaScript"],  "Description":"This is a link to one of my current projects, which is a website for Northern Detailing, a mobile detailing company located in the Northern Suburbs of Melbourne. Although still in development, while browsing you will notice, that it will provide visitors with essential information regarding the company's core values, range of services offered, pricing details for various packages, a showcase of past projects and their outcomes, as well as how to contact the organisation for enquiries or bookings.","url":"https://northern-mobile-detailing.netlify.app/", "github":"https://github.com/Anup-SoftwareDev/MobileDetailing", "image":"3"}

]